app/views/searches/show.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."restaurant_name" = ? AND "favorites"."restaurant_address" = ? AND "favorites"."user_id" = 6 LIMIT ?  [["restaurant_name", "やきとん備長炭 串魂‐くしだましい‐ 品川店"], ["restaurant_address", "〒108-0075 東京都港区港南2-14-10 品川駅前港南ビル2F"], ["LIMIT", 1]]
---
  <% if current_user.present? %>
    <% if Favorite.find_by(restaurant_name: @restaurant["name"], restaurant_address: @restaurant["address"], user_id: current_user) %>