app/controllers/favorites_controller.rb

  def create
    restaurant_name      = params["rest_name"]
    restaurant_address   = params["rest_add"]
    restaurant_latitude  = params["rest_lat"]
    restaurant_longitude = params["rest_lng"]
    favorite = current_user.favorites.build(restaurant_name: restaurant_name, restaurant_address: restaurant_address)
    @restaurant = { "name" => restaurant_name, "address" => restaurant_address, "latitude" => restaurant_latitude, "longitude" => restaurant_longitude }
    if favorite.save
---
INSERT INTO "favorites" ("user_id", "created_at", "updated_at", "restaurant_address") VALUES (?, ?, ?, ?)  [["user_id", 6], ["created_at", "2021-01-02 17:33:54.139144"], ["updated_at", "2021-01-02 17:33:54.139144"], ["restaurant_address", "〒105-0004 東京都港区新橋2-12-2 3F"]]

  def destroy
    restaurant_name      = params["rest_name"]
    restaurant_address   = params["rest_add"]
    restaurant_latitude  = params["rest_lat"]
    restaurant_longitude = params["rest_lng"]
    favorite = current_user.favorites.find_by(restaurant_name: restaurant_name, restaurant_address: restaurant_address)
    @restaurant = { "name" => restaurant_name, "address" => restaurant_address, "latitude" => restaurant_latitude, "longitude" => restaurant_longitude }
    if favorite.present?
      favorite.destroy
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_name" = ? AND "favorites"."restaurant_address" = ? LIMIT ?  [["user_id", 6], ["restaurant_name", "やきとん備長炭 串魂‐くしだましい‐ 品川店"], ["restaurant_address", "〒108-0075 東京都港区港南2-14-10 品川駅前港南ビル2F"], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."restaurant_address" = ? LIMIT ?  [["user_id", 6], ["restaurant_address", "〒105-0004 東京都港区新橋2-12-2 3F"], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]